Documents/ЗаданиеТехнологаНаДегустацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаданиеТехнологаНаДегустацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АК_РассылкиПоставщикамТехнологам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СканироватьШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоНеобходимыхДегустаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаяДоляПоложительныхРезультатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритичнаяДоляОтрицательныхРезультатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтносительноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеОбъектРоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОбъектРоль</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРолиID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыРолейПользователя</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОценкиЗадачТехнологаНаДегустацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОценкиЗадачТехнологаНаДегустацию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаданиеТехнологаНаДегустацию</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеТехнологаНаДегустацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСообщенийМОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийМОС</Name>
			<Comment>Типы сообщений механизма обмена сообщениями (МОС)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнформационноеСообщение</Name>
					<Comment>Служит для передачи информации в магазин из центрального офиса</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инцидент</Name>
					<Comment>Служит для передачи информации о возникшем отклонении, которое необходимо устранить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Служит для постановки задачи исполнителям</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПолучателейМОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПолучателейМОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УказаннаяРоль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеМагазины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокМагазинов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеТехнологаНаДегустацию/Ext/ManagerModule.bsl
Процедура СформироватьСообщенияМагазинам(Ссылка, МассивМагазинов) Экспорт
	
	Если МассивМагазинов.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоКопияБазы() Тогда Возврат; КонецЕсли;
	
	НомерДатаСтр = " №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy");
	Тема = "Задача контролёра качества на дегустацию " + НомерДатаСтр;
	ТекстСообщения =
		"Задача контролёра качества на дегустацию " + НомерДатаСтр + ".
		|
		|Нужно продегустировать номенклатуру:
		|" + Ссылка.Номенклатура + " (" + Ссылка.ХарактеристикаНоменклатуры + ")
		|и внести в задачу оценку и комментарий.";
	
	Если НЕ ПустаяСтрока(Ссылка.Комментарий) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "
		|Примечание к задаче: " + Ссылка.Комментарий;
	КонецЕсли;
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("ТипСообщения", Перечисления.ТипыСообщенийМОС.ИнформационноеСообщение);
	ПараметрыСообщения.Вставить("ВидПолучателей", Перечисления.ВидыПолучателейМОС.СписокМагазинов);
	ПараметрыСообщения.Вставить("ВсемСменам", Истина);
	ПараметрыСообщения.Вставить("Тема", Тема);
	ПараметрыСообщения.Вставить("ТекстСообщения", ТекстСообщения);
	ПараметрыСообщения.Вставить("СписокМагазинов", МассивМагазинов); //СтруктурныеЕдиницы
	ПараметрыСообщения.Вставить("ОбъектИнициатор", Ссылка.Ссылка);
	ПараметрыСообщения.Вставить("Отправитель", Справочники.РолиПользователей.Администратор);
	//ПараметрыСообщения.Вставить("ШаблонСообщений", Справочники.ШаблоныСообщенийМОС.УведомлениеЗаданиеТехнолога);
	
	СообщениеОбОшибке = "";
	Попытка
		СообщениеОбОшибке = МеханизмОбменаСообщениями.СоздатьИОтправитьСообщение(ПараметрыСообщения, Истина);
		СообщениеОбОшибке = ?(ТипЗнч(СообщениеОбОшибке) = Тип("ДокументСсылка.СообщениеМОС"), "", СообщениеОбОшибке);
	Исключение
		СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки; 
	
	Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = "Ошибка формирования сообщений магазинам: " + СообщениеОбОшибке;
		Сообщить(СообщениеОбОшибке);
		ЗаписьЖурналаРегистрации("Документ.ЗаданиеТехнологаНаДегустацию", УровеньЖурналаРегистрации.Ошибка,, Ссылка.Ссылка, СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	//первичная рассылка по эл. почте, пока убрал
	Возврат;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктурныеЕдиницы.Ссылка,
		|	СтруктурныеЕдиницы.АдресЭлектроннойПочты КАК АдресЭП
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.Ссылка В(&МассивМагазинов)
		|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницы.АдресЭлектроннойПочты КАК СТРОКА(1))) <> """"");
	Запрос.УстановитьПараметр("МассивМагазинов", МассивМагазинов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	МассивАдресовЭП = Новый Массив;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		МассивАдресовЭП.Добавить(ВыборкаЗапроса.АдресЭП);
	КонецЦикла;
	
	Если МассивАдресовЭП.Количество() > 0 Тогда
		Документы.ЗаданиеТехнологаМагазинам.ОтправитьСообщение(Тема, ТекстСообщения, МассивАдресовЭП, "Задания контролёра качества на дегустацию");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКаталогХраненияФайлов(СсылкаИлиДата) Экспорт
Перем ДатаДок;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаДок = ?(ТипЗнч(СсылкаИлиДата) = Тип("Дата"), СсылкаИлиДата, СсылкаИлиДата.Дата);
	КаталогХраненияФайлов = СокрЛП(Константы.КаталогХраненияФайлов.Получить());
	КаталогХраненияФайлов = КаталогХраненияФайлов + ?(Прав(КаталогХраненияФайлов, 1) = "\", "", "\") + "Документ.ЗаданиеТехнологаНаДегустацию\" + Формат(ДатаДок, "ДФ=yyyyMM") + "\";
	
	ФайлКаталогХраненияФайлов = Новый Файл(КаталогХраненияФайлов);
	Если НЕ ФайлКаталогХраненияФайлов.Существует() Тогда
		СоздатьКаталог(КаталогХраненияФайлов);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КаталогХраненияФайлов;
	
КонецФункции // ПолучитьКаталогХраненияФайлов()

Процедура ЗакрытьЗадачиПоЗаданию(Ссылка, ЗакрыватьЗадачи = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачаТехнологаНаДегустацию.Ссылка,
		|	ЗадачаТехнологаНаДегустацию.Закрыта КАК ЗадачаЗакрыта,
		|	ВЫБОР
		//+++АК ILIK 2018.08.08 ИП-00019413
		//|		КОГДА ЗадачаТехнологаНаДегустацию.Магазин.СтатусТорговойТочки = ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)
		|		КОГДА ЗадачаТехнологаНаДегустацию.Магазин.СтатусТорговойТочки В (ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт), ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Приостановлен))
		//---АК ILIK
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МагазинЗакрыт
		|ИЗ
		|	Документ.ЗадачаТехнологаНаДегустацию КАК ЗадачаТехнологаНаДегустацию
		|ГДЕ
		|	ЗадачаТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию = &Ссылка
		|	И НЕ ЗадачаТехнологаНаДегустацию.Закрыта = &ЗакрыватьЗадачи
		|
		|ДЛЯ ИЗМЕНЕНИЯ");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗакрыватьЗадачи", ЗакрыватьЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЗадачаТехнологаНаДегустациюОбъект = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		
		Если ВыборкаЗапроса.МагазинЗакрыт Тогда
			Если НЕ ВыборкаЗапроса.ЗадачаЗакрыта Тогда 
				ЗадачаТехнологаНаДегустациюОбъект.Закрыта = Истина;
			КонецЕсли;
		Иначе
			ЗадачаТехнологаНаДегустациюОбъект.Закрыта = ЗакрыватьЗадачи;
		КонецЕсли;
		
		ЗадачаТехнологаНаДегустациюОбъект.Записать();
		Сообщить("Закрыт документ " + ЗадачаТехнологаНаДегустациюОбъект.Ссылка);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ВернутьТЗнОтветственных(ЗаданиеТехнологаСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Управляющий управления качества"" КАК ТипРолиСтр,
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)) КАК РольПользователя
		|ИЗ
		|	Документ.ЗаданиеТехнологаНаДегустацию КАК ЗаданиеТехнологаНаДегустацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (РолиПользователейСоставРоли.Ссылка = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя.Родитель, СоответствиеОбъектРольСрезПоследнихК.РольПользователя.Родитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеТехнологаНаДегустацию.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Технолог по качеству"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|ИЗ
		|	Документ.ЗаданиеТехнологаНаДегустацию КАК ЗаданиеТехнологаНаДегустацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (РолиПользователейСоставРоли.Ссылка = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя)
		|				ИЛИ РолиПользователейСоставРоли.Ссылка.Родитель = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеТехнологаНаДегустацию.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Товаровед"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|ИЗ
		|	Документ.ЗаданиеТехнологаНаДегустацию КАК ЗаданиеТехнологаНаДегустацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеТехнологаНаДегустацию.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.БрендМенеджер)
		|					И Объект ССЫЛКА Справочник.РолиПользователей) КАК СоответствиеОбъектРольСрезПоследнихБМ
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (СоответствиеОбъектРольСрезПоследнихБМ.Объект = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (РолиПользователейСоставРоли.Ссылка = СоответствиеОбъектРольСрезПоследнихБМ.РольПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеТехнологаНаДегустацию.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаданиеТехнологаНаДегустацию.Автор.ФизЛицо,
		|	""Автор"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)
		|ИЗ
		|	Документ.ЗаданиеТехнологаНаДегустацию КАК ЗаданиеТехнологаНаДегустацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (ЗаданиеТехнологаНаДегустацию.Автор.ФизЛицо = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеТехнологаНаДегустацию.Ссылка = &ЗаданиеТехнологаСсылка");
	Запрос.УстановитьПараметр("ЗаданиеТехнологаСсылка", ЗаданиеТехнологаСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПолучитьДолиРезультатов(ЗаданиеТехнологаНаДегустациюСсылка, ТекущаяДоляПоложительныхРезультатов, ТекущаяДоляОтрицательныхРезультатов) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОценкиЗадачТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию,
		|	ОценкиЗадачТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию.МинимальноеКоличествоНеобходимыхДегустаций КАК МинимальноеКоличествоНеобходимыхДегустаций,
		|	СУММА(ВЫБОР
		|			КОГДА ОценкиЗадачТехнологаНаДегустацию.Оценка МЕЖДУ 1 И 5
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КвоДегустаций,
		|	СУММА(ВЫБОР
		|			КОГДА ОценкиЗадачТехнологаНаДегустацию.Оценка МЕЖДУ 1 И 3
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КвоОтрицательных,
		|	СУММА(ВЫБОР
		|			КОГДА ОценкиЗадачТехнологаНаДегустацию.Оценка МЕЖДУ 4 И 5
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КвоПоложительных
		|ПОМЕСТИТЬ РезультатыДегустаций
		|ИЗ
		|	РегистрСведений.ОценкиЗадачТехнологаНаДегустацию КАК ОценкиЗадачТехнологаНаДегустацию
		|ГДЕ
		|	ОценкиЗадачТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию = &ЗаданиеТехнологаНаДегустацию
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиЗадачТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию,
		|	ОценкиЗадачТехнологаНаДегустацию.ЗаданиеТехнологаНаДегустацию.МинимальноеКоличествоНеобходимыхДегустаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыДегустаций.ЗаданиеТехнологаНаДегустацию,
		|	ВЫБОР
		|		КОГДА РезультатыДегустаций.КвоДегустаций >= РезультатыДегустаций.МинимальноеКоличествоНеобходимыхДегустаций
		|			ТОГДА РезультатыДегустаций.КвоОтрицательных / (РезультатыДегустаций.КвоДегустаций + 1)
		|		ИНАЧЕ РезультатыДегустаций.КвоОтрицательных / (РезультатыДегустаций.МинимальноеКоличествоНеобходимыхДегустаций + 1)
		|	КОНЕЦ КАК ДоляОтрицательных,
		|	ВЫБОР
		|		КОГДА РезультатыДегустаций.КвоДегустаций >= РезультатыДегустаций.МинимальноеКоличествоНеобходимыхДегустаций
		|			ТОГДА РезультатыДегустаций.КвоПоложительных / (РезультатыДегустаций.КвоДегустаций + 1)
		|		ИНАЧЕ РезультатыДегустаций.КвоПоложительных / (РезультатыДегустаций.МинимальноеКоличествоНеобходимыхДегустаций + 1)
		|	КОНЕЦ КАК ДоляПоложительных
		|ИЗ
		|	РезультатыДегустаций КАК РезультатыДегустаций");
	Запрос.УстановитьПараметр("ЗаданиеТехнологаНаДегустацию", ЗаданиеТехнологаНаДегустациюСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекущаяДоляПоложительныхРезультатов = 0;
		ТекущаяДоляОтрицательныхРезультатов = 0;
	Иначе
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		ТекущаяДоляПоложительныхРезультатов = ВыборкаЗапроса.ДоляПоложительных;
		ТекущаяДоляОтрицательныхРезультатов = ВыборкаЗапроса.ДоляОтрицательных;
	КонецЕсли;
	
КонецПроцедуры
